controllers/AdminController.php

SELECT * FROM `venta` WHERE DATE_FORMAT(dia_registro,'%M-%Y') >= 'December-2017'
---
            }
        }

        $allVentas = Venta::find()->all();