models/Vendedor.php

    public static function getById($id){
        $user = Vendedor::findOne(["id" => $id]);
---
SELECT * FROM `vendedor` WHERE `id`=3

    public static function getAllSupers(){
        $supers = Vendedor::find()->where(['tipo_usuario'=> '2'])->all();
---
SELECT * FROM `vendedor` WHERE `tipo_usuario`='2'

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);
---
SELECT * FROM `vendedor` WHERE `id`=3

    public function findByUsername($username){
        Utils::log("User::findByUsername para " . $username);
        return $this->findOne(['username' => $username]);
---
SELECT * FROM `vendedor` WHERE `username`='test'